{"meta":{"title":"ciazhar","subtitle":"Someone INTJs","description":null,"author":"Muhammad Hafidz","url":"http://ciazhar.github.io"},"pages":[{"title":"About","date":"un55fin55","updated":"un55fin55","comments":true,"path":"about/index.html","permalink":"http://ciazhar.github.io/about/index.html","excerpt":"","text":"Muhammad Hafidz"}],"posts":[{"title":"Bagian Processor","slug":"orakom-bagian-processor","date":"un11fin11","updated":"un11fin11","comments":true,"path":"2017/04/17/orakom-bagian-processor/","link":"","permalink":"http://ciazhar.github.io/2017/04/17/orakom-bagian-processor/","excerpt":"","text":"ALU (Arithmetic and Logic Unit) ALU merupakan bagian pengolah biner di processor. ALU bertugas melalukan operasi aritmatika dan logika sesuai instruksi yang diberikan. Control Unit Control Unit bertugas memberikan arahan / kendali / kontrol terhadap operasi yang dilakukan oleh ALU Register Register merupakan perangkat memori sementara yang menyimpan data dari suatu program yang sedang berjalan.","categories":[{"name":"Teknologi","slug":"Teknologi","permalink":"http://ciazhar.github.io/categories/Teknologi/"},{"name":"Organisasi dan Arsitektur Komputer","slug":"Teknologi/Organisasi-dan-Arsitektur-Komputer","permalink":"http://ciazhar.github.io/categories/Teknologi/Organisasi-dan-Arsitektur-Komputer/"}],"tags":[{"name":"komputer","slug":"komputer","permalink":"http://ciazhar.github.io/tags/komputer/"}]},{"title":"Sistem Bilangan","slug":"orakom-sistem-bilangan","date":"un11fin11","updated":"un11fin11","comments":true,"path":"2017/04/17/orakom-sistem-bilangan/","link":"","permalink":"http://ciazhar.github.io/2017/04/17/orakom-sistem-bilangan/","excerpt":"","text":"Macam-macam Sistem Bilangan Biner (basis 2)Simbol : 0,1 Oktal (basis 8)Simbol : 0,1,2,3,4,5,6,7 Desimal (basis 10)Simbol : 0,1,2,3,4,5,6,7,8.9 Heksal (basis 16)Simbol : 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15 Konversi antar Sistem Bilangan Desimal ke Biner Contoh : Semisal kita akan mengubah 123(10) ke biner. Hal pertama yang harus kita lakukan adalah membagi angka tersebut dengan 2, kemudian hasil pembagian kita taruh dibagian bawah. Dan apabila angka habis dibagi 2 maka kita tulis 0 dan apabila bersisa kita tulis 1 di bagian samping. Lakukan langkah tersebut secara berulang-ulang sampai hasilnya tidak bisa dibagi 2 lagi. Contohnya adalah sebagai berikut : 12345678910111213123--- = 161--- = 130--- = 015--- = 17--- = 13--- = 11 Dari hasil diatas kita dapatkan hasil 1 1 1 1 0 1 1 (dibaca dari bawah). Jadi biner dari 123 adalah 1111011. Biner ke Desimal Contoh : Semisal kita akan mengubah 1111011(2) ke desimal. Hal pertama yang kita lakukan adalah mendefinisikan tiap digit dengan 2 pangkat nomer digit. Digit dihitung dari belakang. Contohnya adalah sebagai berikut : 12342^6 2^5 2^4 2^3 2^2 2^1 2^064 32 16 8 4 2 11 1 1 1 0 1 1 Kemudian kita tambahkan tiap hasil dari 2 pangkat nomer digit yang bilangan binernya 1. 64+32+16+8+4+2+1 = 123. Dari penjumlahan tersebut kita dapatkan hasil 123, jadi desimal dari 1111011 adalah 123.","categories":[{"name":"Teknologi","slug":"Teknologi","permalink":"http://ciazhar.github.io/categories/Teknologi/"},{"name":"Organisasi dan Arsitektur Komputer","slug":"Teknologi/Organisasi-dan-Arsitektur-Komputer","permalink":"http://ciazhar.github.io/categories/Teknologi/Organisasi-dan-Arsitektur-Komputer/"}],"tags":[{"name":"komputer","slug":"komputer","permalink":"http://ciazhar.github.io/tags/komputer/"}]},{"title":"Getting Started with Hexo","slug":"hello-world","date":"un00fin00","updated":"un00fin00","comments":true,"path":"2017/04/16/hello-world/","link":"","permalink":"http://ciazhar.github.io/2017/04/16/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"Pemrograman","slug":"Pemrograman","permalink":"http://ciazhar.github.io/categories/Pemrograman/"},{"name":"Hexo","slug":"Pemrograman/Hexo","permalink":"http://ciazhar.github.io/categories/Pemrograman/Hexo/"}],"tags":[]},{"title":"Bagaimana Perangkat Elektronik Berjalan ?","slug":"orakom_bagaimana-perangkat-elektronik-berjalan","date":"un66fin66","updated":"un11fin11","comments":true,"path":"2017/04/15/orakom_bagaimana-perangkat-elektronik-berjalan/","link":"","permalink":"http://ciazhar.github.io/2017/04/15/orakom_bagaimana-perangkat-elektronik-berjalan/","excerpt":"","text":"Dalam kehidupan sehari-hari kita sering sekali menggunakan perangkat elektronik seperti komputer, laptop dan hp. Perangkat elektronik tersebut sudah didesain sedimikian rupa agar dapat nyaman berinteraksi dengan penggunanya, baik dari desain, perangkat input dll. Tetapi pernahkah anda berpikir bagaimana cara kerjanya alat-alat tersebut? Bagaimana data dari keyboard, mouse atau perangkat input lainya diproses ? Dan tentunya akan banyak sekali pertanyaan mengenai hal tersebut. Pada kesempatan ini saya akan sedikit menceritakan bagaimana proses data di perangkat elektronik tersebut. Proses BootingHal pertama yang dilakukan perangkat saat proses booting adalah melakukan booting Sistem Operasi. Kemudian perangkat akan melakukan inisialisasi, yaitu melakukan checklist terhadap hardware yang terhubung dengan perangkat kita. Transfer Data pada KomputerData yang kita inputkan melalui perangkat masukan sebenarnya adalah kumpulan pola arus listrik yang dikonversi menjadi kode biner. Secara teknis untuk tegangan 0 volt akan dikonversi menjadi kode biner 0 dan tegangan 5 volt akan dikonversi menjadi kode biner 1. Proses konversi dari arus listrik menjadi biner ini dilakukan oleh Flip Flop yang terdiri dari kumpulan gerbang logika. Data biner tersebut kemudian dibawa menuju register yang ada pada processor untuk disimpan. Setiap kode biner akan menghuni satu space register. Pengggambaran bagaimana data tersebut disimpan adalah seperti gambar di bawah ini :1234567_________________________________| | | | || 1 | 2 | 3 | 4 | --&gt; Register|_______|_______|_______|_______| | | | | || 0 | 1 | 0 | 0 | --&gt; Biner|_______|_______|_______|_______| Lanjut, data yang ada pada register kemudian diproses, apakah akan dioutputkan atau akan disimpan sesuai dengan yang kita inginkan. Apabila ingin dioutputkan data akan ditransfer menuju perangkat keluaran yang dikehendaki, semisal layar monitor. Dan apabila ingin disimpan sebelumnya akan dikonversi menuju kode heksal. Proses konversi dari kode biner dan heksal dan sebaliknya dilakukan oleh Sistem Operasi. Data pada hardisk yang berupa kode heksal apabila ingin diproses maka harus dikonversi kembali menjadi kode desimal. Data tersebut kemudian diteruskan melalui RAM dan berakhir di Processor. Dalam tahap pemrosesan data, data tadi akan disimpan sementara pada cache memory yang ada pada processor.","categories":[{"name":"Teknologi","slug":"Teknologi","permalink":"http://ciazhar.github.io/categories/Teknologi/"},{"name":"Organisasi dan Arsitektur Komputer","slug":"Teknologi/Organisasi-dan-Arsitektur-Komputer","permalink":"http://ciazhar.github.io/categories/Teknologi/Organisasi-dan-Arsitektur-Komputer/"}],"tags":[{"name":"komputer","slug":"komputer","permalink":"http://ciazhar.github.io/tags/komputer/"}]},{"title":"Fill in form dan Function Key","slug":"ui-ux-fill-in-form-dan-function-key","date":"un55fin55","updated":"un00fin00","comments":true,"path":"2017/04/14/ui-ux-fill-in-form-dan-function-key/","link":"","permalink":"http://ciazhar.github.io/2017/04/14/ui-ux-fill-in-form-dan-function-key/","excerpt":"","text":"FILL IN FORMDefinisi Fill in Form : Sebuah tabel data yang diwajibkan diisi oleh user, data tersebut biasanya digunakan untuk sebuah pendaftaran. Data yang diinputkan umumnya banyak keakuratan data, misal fill in form memerintahkan user untuk memasukkan data pribadi ( nama, umur, jenis kelamin dst ). Hal yang perlu diperhatikan terkait Fill In Form : Keyboard. Kegunaan Tab atau Mouse untuk memindahkan cursor. Maksud dari masing - masing field dan label. Metode dalam mengoreksi kesalahan. Kegunaan Enter dan Return. Pedoman dalam membuat Fill Inform : Berikan judul yang jelas dan memiliki arti. Instruksi yang komprehensif. Pengelompokkan dan pengurutan secara logikal. Layout ( Desain tata letak ) yang mudah dilihat. Berikan nama field yang dikenal secara umum. Berikan tempat yang jelas untuk menginputkan data, Pergerakan kursor yang nyaman. Berikan koreksi eror / penanganan kesalahan untuk setiap karakter tidak tepat yang diinputkan. Sertakan informasi mengenai status pengisian form. Kelebihan Fill In Form : Keterbiasaan Pengguna dalam Mengisi Form dapat mempermudah pengisian. Beban memori rendah. Perancangan yang mudah dengan berbagai alat/Software bantu perancangan tampilan. Isian Formulir yang disederhanakan. Kekurangan Fill In Form : Bila tak terbiasa, membutuhkan waktu bagi user untuk memahami dan mengisi form. Jika Formulir bermenu datar, akan memakan ruang pada layar. Pembuatan data pertanyaan harus logis dan tersusun dengan jelas jika tidak akan membuat user kebingungan. FUNCTION KEYSPendahuluan : Tahun 1986, IBM ( International Business Machine ) menambahkan beberapa tombol fungsi pada keyboard standard. Tombol ini dapat dipergunakan sebagai perintah khusus yang disertakan pada sistem operasi maupun aplikasi dan disebut function keys. Key Modal Styles : Penyampaian “aksi” melalui penekanan tombol-tombol yang diprogram sebelumnya untuk menjalankan perintah tertentu. Definisi : Tombol khusus yang terdapat pada keyboard yang memberikan masukan tanpa berhubungan dengan setiap karakter F1 s/d F12. Contoh Fungsi umumnya : 123456789101112F1 = Help.F2 = Merubah nama file.F3 = Search.alt + F4 = Menutup program yang sedang berjalan.F5 = Refresh.F6 = Memindahkan kursor ke Address bar.F7 = memeriksa ejaan/tata bahasa (Ms. Word).F8 = Tombol fungsi yang digunakan untuk masuk ke menu startup windows, biasa digunakan masuk ke Windows Safe Mode.F9 = Untuk membuka toolbar Measurements pada Quark 5.0.shift + F10 = Menampilkan menu shortcut ( MS Word ).F11 = Full Screen pada browser.shift + F12 = Save As ( MS. Word ). Kelebihan Function Keys : Mempermudah pekerjaan. Kecepatan yang lebih tinggi dan praktis. Dapat menjadi pengganti input saat mouse sedang error. Kekurangan Function Keys : Jarang Digunakan dan Diketahui oleh pengguna - pengguna baru.","categories":[{"name":"Teknologi","slug":"Teknologi","permalink":"http://ciazhar.github.io/categories/Teknologi/"},{"name":"Interaksi Manusia dan Komputer","slug":"Teknologi/Interaksi-Manusia-dan-Komputer","permalink":"http://ciazhar.github.io/categories/Teknologi/Interaksi-Manusia-dan-Komputer/"}],"tags":[{"name":"ui-ux","slug":"ui-ux","permalink":"http://ciazhar.github.io/tags/ui-ux/"}]},{"title":"Kritik dan Saran terhadap Website KPM Udinus","slug":"Kritik-dan-Saran-terhadap-Website-KPM-Udinus","date":"un22fin22","updated":"un00fin00","comments":true,"path":"2017/04/11/Kritik-dan-Saran-terhadap-Website-KPM-Udinus/","link":"","permalink":"http://ciazhar.github.io/2017/04/11/Kritik-dan-Saran-terhadap-Website-KPM-Udinus/","excerpt":"","text":"Sekilas Tentang KPM UDINUSKantor Penjaminan Mutu Univeristas Dian Nuswantoro adalah suatu badan internal di bawah Universitas Dian Nuswantoro yang bertujuan untuk mengembangkan sistem penjaminan mutu, menyelenggarakan sistem audit mutu internal dalam rangka pelaksanaan sistem penjaminan mutu dan menjamin perbaikan mutu secara terus menerus terhadap pencapaian kinerja penyelenggaraan pendidikan tinggi di Universitas Dian Nuswantoro. Kritik dan Saran Copyright telah kadaluarsa. Seharusnya selalu diperbaharui secara konsekuen. Kemudian perlu ditambahkan instansi (udinus) karena KPM sendiri berada di bawah udinus. Foto dari Anggota KPM tidak proporsional dan tidak rapi. Pada laman web terlalu kecil sedangkan pada mobile terlalu besar. Pada laman web foto tidak center dan penulisanya tidak rapi. Seharusnya kontenya dikonfigurasi agar progresive dan rapi. Kami menyarankan menggunakan grid system yang ada pada bootstrap agar lebih mudah dalam mengkonfigurasinya. Tidak terdapat paging indeks halaman sehingga kontennya terlihat semua dan website terlihat tidak sedap di pandang mata. Seharusnya dikonfigurasi semisal untuk setiap laman hanya berisi 10 konten. Dan untuk mengakses konten lainya melalui indeks selanjutnya. Terdapat 2 tombol home pada halama utama yang membingungkan user. Seharusnya satu saja sudah cukup. Konten yang belum siap dipublikasikan sebaiknya tidak perlu di tampilkan di menu. (contohnya Pelatihan, Bantuan Teknis, Kunjungan dll) Terdapat laman yang kontenya terlalu sepi, sehingga perlu ditambahkan konten lain yang relevan. Perlu ditambahkan fasilitash search untuk memudahkan user mencari konten yang dikehendaki. Perlu dicantumkan kontak person pada bagian bawah web. Sehingga apabila terjadi permasalahan pada webiste dan sebagainya dapat langsung ditanggulangi. Seperti pada http://kjm.ugm.ac.id/ Perlu ditambahkan jadwal agenda kegiatan mengenai kpm. Seperti pada http://kjm.ugm.ac.id/ Perlu ditambahkan laman mengenai sambutan ketua kpm untuk menambah kesan hangat kepada pengunjung webste. Seperti pada http://kjm.ugm.ac.id/sambutan-rektor-universitas-gadjah-mada-prof-dr-pratikno-m-soc-sc/","categories":[{"name":"Teknologi","slug":"Teknologi","permalink":"http://ciazhar.github.io/categories/Teknologi/"},{"name":"Interaksi Manusia dan Komputer","slug":"Teknologi/Interaksi-Manusia-dan-Komputer","permalink":"http://ciazhar.github.io/categories/Teknologi/Interaksi-Manusia-dan-Komputer/"}],"tags":[]},{"title":"Bahasa Perintah dan Bahasa Alami","slug":"ui-ux_common-language-and-natural-language","date":"un11fin11","updated":"un00fin00","comments":true,"path":"2017/03/27/ui-ux_common-language-and-natural-language/","link":"","permalink":"http://ciazhar.github.io/2017/03/27/ui-ux_common-language-and-natural-language/","excerpt":"","text":"Pendahuluan Tujuan dasar bahasa presisi kekompakan kemudahan dalam penulisan dan pembacaan mudah dipelajari sederhana dan mengurangi kesalahan mudah diingat Tujuan tingkat lebih tinggi Hubungan yang dekat antara realitas dan notasi. Kemudahan dalam melaksanakan manipulasi yang relevan dengan tugas. Kompatibilitas dengan notasi yang telah ada. Fleksibilitas untuk mengakomodasi pemakai pemula dan ahli. Ekspresif, mendukung kreativitas. Daya tarik visual. Kendala-kendala penggunaan Bahasa kapasitas manusia mengingat notasi kecocokan antara ingatan dan media penampil kemudahan berbicara(mengucapkan) Bahasa komputer yang efektifBahasa komputer yang efektif harus tidak hanya merepresentasikan tugas pemakai dan memenuhi kebutuhan manusia untuk berkomunikasi, tetapi juga harus selaras dengan mekanisme perekaman, manipulasi, dan penampilannya di komputer.Beberapa contoh bahasa yang efektif Bahasa pemrograman: Pemakaian noninteraktif: Fortran, COBOL, ALGOL, PL/I, Pascal. Inkremental: BASIC, LISP, APL, PROLOG. Kompilasi dan eksekusi cepat: C. Pemrograman tim, sharing, reusability: ADA, C++. Jaringan, cross-platform: Java. Scripting World Wide Web: PHP, JavaScript, VBScript. Alamat World Wide Web. Bahasa database query: SQL. Bahasa perintah command line: perintah Unix, MS-DOS. Strategi Organisasi perintah Simple command setSetiap perintah dipilih untuk melaksanakan tugas (task) tunggal, jumlah perintah sama dengan jumlah tugas.Contoh: vim editor (Unix):0 : go to start of line$ : go to end of line(space) : go right one spaceH : go left one spaceW : forward one wordb : backward one word) : forward one sentence( : backward one sentence Command plus argumentsPerintah diikuti argumen yang menunjukkan objek yang dimanipulasi.Contoh: 12COPY FILEA FILEBDEL FILEA Label keyword dapat membantu untuk meningkatkan keterbacaan dan meniadakan urutan. 1&lt;img src=\"gbr.gif\" width=\"40\" height=\"5\" alt=\"Gambar\"&gt; Command plus options and argumentsPerintah dapat berisi options untuk menunjukkan kondisi khusus.Jumlah argumen dan option yang banyak dapat meningkatkan tingkat kesalahan.Contoh: 12DIR C:\\WINDOWS\\*.EXE /S/W/P/O-Nls -alF /home/agus Hierarchical command structurePerangkat penuh perintah disusun menjadi struktur tree, seperti menu tree.Contoh: 123456Action Object DestinationCREATE File FileDISPLAY Process Local printerREMOVE Directory ScreenCOPY Remote printerMOVE Contoh di atas menghasilkan struktur berarti bagi5 × 3 × 4 = 60 tugas. Manfaat Struktur- Manfaat struktur: - Membantu proses belajar manusia, pemecahan masalah, dan ingatan. - Membantu task concepts, computer concepts, dan rincian sintaktik bahasa perintah. - Topik: - Urutan argumen yang konsisten - Simbol vs keyword - Struktur hierarkis dan kongruensi Urutan Argumen yang konsistensiBeberapa studi menunjukkan adanya manfaat urutan argumen yang konsisten. 123456Inconsistent order Consistent orderSEARCH file no, message id SEARCH message id, file noTRIM message id, segment size TRIM message id, segment sizeREPLACE message id, code no REPLACE message id, code noINVERT group size, message id INVERT message id, group size Simbol Lawan KeywordPenggunaan keyword lebih mudah daripada simbol. Pemakai berpengalaman dapat mengembangkan keterampilan untuk menggunakan notasi aneh sehingga variasi sintaktik tidak banyak berpengaruh. 12345Symbol Editor Keyword EditorFIND:/TOOTH/-1 BACKWARD TO “TOOTH”LIST;10 LIST 10 LINESRS:/KO/,/OK/;* CHANGE ALL “KO” TO “OK” Struktur Hierarkis dan KongruensiKongruen: pasangan yang berlawanan secara selaras dan berarti (simetris). Struktur hierarkis dan kongruensi dapat membantu ingatan pemakai. 1234567891011121314151617CongruentHierarchical NonhierarchicalMOVE ROBOT FORWARD ADVANCEMOVE ROBOT BACKWARD RETREATMOVE ARM FORWARD PUSHMOVE ARM BACKWARD PULLMOVE ARM RIGHT SWING OUTMOVE ARM LEFT SWING INNoncongruentHierarchical NonhierarchicalMOVE ROBOT FORWARD GOCHANGE ROBOT BACKWARD BACKCHANGE ARM FORWARD POKEMOVE ARM BACKWARD PULLCHANGE ARM RIGHT PIVOTMOVE ARM LEFT SWEEP Ringkasan Manfaat StrukturSumber struktur yang terbukti bermanfaat meliputi: - Konsistensi posisi - Konsistensi tatabahasa - Pasangan yang kongruen - Bentuk hierarkis Penamaan perintah Penamaan penting untuk proses belajar, pemecahan masalah, dan ingatan. Ketertentuan (specificity) vs keumuman (generality): Istilah-istilah yang spesifik lebih deskriptif dan lebih mudah diingat. Istilah-istilah yang umum lebih dikenal dan mudah diterima.Contoh pengujian untuk menambah dan menghapus teks (Black &amp; Moran): 1234567Infrequent, discriminating words insert deleteFrequent, discriminating words add removeInfrequent, nondiscriminating words amble perceiveFrequent, nondiscriminating words walk viewGeneral words (frequent, nondiscr.) alter correctNondiscriminating nonwords (nonsense) GAC MIKDiscriminating nonwords (icons) abc-adbc abc-ac Paling baik: “infrequent, discriminating”Paling buruk: general words.Nonsense cukup baik! Penyingkatan Perintah Pemotongan sederhana.directory -&gt; dir, delete -&gt; del. Buang huruf hidup dengan pemotongan sederhana.check disk -&gt; chkdsk, move -&gt; mv. Huruf pertama dan terakhir.sort -&gt; ST, block -&gt; BK. Huruf awal setiap kata dalam frase.change directory -&gt; cd, switch user -&gt; su. Singkatan standar dari konteks lain.quantity -&gt; QTY, transfer -&gt; XFER,backup -&gt; BAK. Fonik: fokus pada suara.execute -&gt; XQT, I seek you -&gt; ICQ,connection -&gt; CNXN. Menu perintahUntuk mengatasi beban penghafalan perintah, beberapa perancang memberikan daftar perintah yang tersedia, dalam format yang disebut menu perintah. Contoh: 123456789101112131415Lynx H)elp O)ptions P)rint G)o M)ain screen Q)uit /=search [delete]=history listPico ^G Get Help ^O Writeout ^R Read File ^X Exit ^J Justify ^W Where isWordStar --Cursor Movement-- | -Delete-^S char left ^D char right |^G char^A word left ^F word right |DEL chr lf^E line up ^X line down | ^T word rt --Scrolling–- |^Y line^Z line down ^W line up |^C screen up ^R screen down | Bahasa Alami di dalam komputer Natural-language interactionOperasi komputer menggunakan bahasa alami manusia (mis. Inggris) untuk memberi instruksi dan menerima respons. Natural-language queriesOperasi pada database relasional.Masih lebih buruk daripada SQL.Contoh: INTELLECT, Symantec Q&amp;A. Text-database searchingUntuk mencari database tekstual.Contoh: Ask Jeeves (ask.com). Natural-language text generationDigunakan untuk laporan (mis. Prakiraan cuaca, laboratorium medis).Di sisi artistik dapat menghasilkan puisi dan novel. Adventure and educational gamesPemakai menyatakan gerakan dan perintah dengan bahasa alami.Menarik karena sistem tak dapat diramalkan dan perlu dijelajahi. Pedoman bahasa perintah Buat model objek dan aksi yang eksplisit. Pilih nama yang berarti, spesifik, dan dapat dibedakan. Coba mencapai struktur hierarkis. Gunakan struktur yang konsisten (hierarki, urutan argumen, aksi-objek). Dukung aturan penyingkatan yang konsisten. Berikan kemampuan membuat makro bagi frequent users. Pertimbangkan menu perintah pada tampilan berkecepatan tinggi. Batasi jumlah perintah dan cara melakukan tugas.","categories":[{"name":"Teknologi","slug":"Teknologi","permalink":"http://ciazhar.github.io/categories/Teknologi/"},{"name":"Interaksi Manusia dan Komputer","slug":"Teknologi/Interaksi-Manusia-dan-Komputer","permalink":"http://ciazhar.github.io/categories/Teknologi/Interaksi-Manusia-dan-Komputer/"}],"tags":[{"name":"ui-ux","slug":"ui-ux","permalink":"http://ciazhar.github.io/tags/ui-ux/"}]},{"title":"Menu","slug":"ui-ux_menu","date":"un00fin00","updated":"un00fin00","comments":true,"path":"2017/03/19/ui-ux_menu/","link":"","permalink":"http://ciazhar.github.io/2017/03/19/ui-ux_menu/","excerpt":"","text":"Pengertian MenuMenu adalah suatu penyajian petunjuk yang sudah di tentukan untuk memudahkan user. Tujuan MenuMemudahkan user dalam mengoperasikan suatu sistem yang mudah diingat dan dipahami. Kelebihan Menu Memudahkan bagi pengguna baru/tidak ahli Memungkinkan explorasi (pengguna bisa melihat menu untuk perintah lainnya yang cocok) Menginstruksikan pengambilan keputusan bagi pengguna Adanya penanganan kesalahan yang mudah (tidak perlu di-parsed sepeti halnya command entry) Pengguna tidak perlu mengingat item yang diinginkan Kekurangan Menu Tidak cocok untuk tampilan grafis kecil Cukup lambat bagi pengguna ahli/usser yang sering memakai sistem Terlalu banyak menu menyebabkan overload informasi Tipe Tipe MenuAda 2 macam tipe menu berdasarkan banyaknya sub menu pada suatu menu yaitu : Single Menu Multiple Combination Menu Single MenuPengertianSingle menu adalah menu yang berdiri secara independen tidak mempengaruhi yang lainnya. Macam-macamBinary MenuMenu yang terdiri dari dua pilihan. Multiple ItemSingle menu yang mempunyai pilihan lebih dari dua Multiple SelectionVariasi dari single menu yang memungkinkan user untuk memilih lebih dari satu pilihan yang di berikan. Pull Down dan Pop UpPull Down biasanya tersedia pada bagian atas menu bar sedangkan Pop Up keluar dari respon terhadap aksi pengguna ScrollingScrolling dan 2 dimensional menu yaitu menu dengan item list yang banyak sehingga beralasan untuk ditampilkan AlphaslidersAlphasliders menggunakan multiple level granularity pada pergerakan slider-nya atau scroll box. Alphaslider bisa mendukung untuk penggunakan menu dengan jumlah item yang banyak. Embedded LinksMerupakan menu dimana itemnya ditanamkan dalam bentuk teks dan grafik yang bisa ditekan atau dipilih Iconic MenuToolbars, atau palletes menu merupakan menu yang menawarkan banyak aksi yang bisa dipilih oleh pengguna dengan menekan untuk menampilkan. Multiple Combination MenuTree Structured MenusMembagi menu-menu dalam berbagai kelompok sehingga user tidak bingung. Linear SequenceBerfungsi untuk memudahkan user membuat suatu pilihan yang kompleks dan berguna untuk novice user (pemula). Simultaneous menusMemberikan semua pilihan yang mungkin secara bersamaan dan memperbolehkan user untuk memasukkan pilihan secara sembarang. Menu MapsMemperlihatkan semua menu yang ada. Berfungsi suntuk membantu user agar tidak bingung dengan menu yang ada. Cyclic NetworkTipe menu yang dapat bercabang-cabang dan dapat kembali ke menu utama atau menu sebelumnya Acyclic NetworkTipe menu yang dapat bercabang-cabang dan setiap menu dapat ditempu dengan beberapa cara namun tidak dapat kembali ke menu utama atau menu sebelumnya. Petunjuk Pembuatan MenuGuidelines untuk menu : Organisasikan menu berdasarkan jenis pekerjaan Lebih cenderung pada broad – shallow daripada narrow – deep Perlihatkan posisi dengan grafik, angka, ataupun judul Gunakan items sebagai judul untuk subtrees Pengelompokkan item harus memiliki arti Pembuatan urut – urutan item harus memiliki arti Gunakan kalimat singkat (keyword) Perhatikan konsistensi grammar, layout, dan terminologi Sediakan shortcut Perbolehkan user untuk langsung kembali ke menu sebelumnya dan main menu Pertimbangkan online help, response time, display rate, dan ukuran layar Hal-hal Yang Harus Diperhatikan Dalam Menu Layout: Judul Layout dan design(ukuran layar, display rate, character set dan teknik highlighting) Konsistensi (judul, penempatan item, intruksi, pesan kesalahan dan laporan status) Teknik (identasi, huruf besar/kecil,simbol,penanda posisi,cascading menu, magic lens) Pengaturan konten dapat dilakukan dengan memperhatikan hal-hal berikut:● Mengelompokkan suatu pekerjaan yang sama kedalam satu kategori● Membuat menu dengan berurutan, urutan bisa didasarkan pada waktu, nomor urutan dan lain-lain","categories":[{"name":"Teknologi","slug":"Teknologi","permalink":"http://ciazhar.github.io/categories/Teknologi/"},{"name":"Interaksi Manusia dan Komputer","slug":"Teknologi/Interaksi-Manusia-dan-Komputer","permalink":"http://ciazhar.github.io/categories/Teknologi/Interaksi-Manusia-dan-Komputer/"}],"tags":[{"name":"ui-ux","slug":"ui-ux","permalink":"http://ciazhar.github.io/tags/ui-ux/"}]}]}